{
    "nav_title":
    {
        "en": "Kristal Framework",
        "fi": "Kristal Framework"
    },
    "nav_home": {
        "en": "Home",
        "fi": "Etusivu"
    },
    "nav_demo": {
        "en": "Demo",
        "fi": "Demo"
    },





    "home_title": {
        "en": "Kristal Framework",
        "fi": "Kristal Framework"
    },
    "home_version": {
        "en": "Version 1.0, Developed by Jesse Timonen. Happy Coding!",
        "fi": "Versio 1.0, Kehittäjänä Jesse Timonen."
    },
    "home_information_1": {
        "en": "Kristal Framework is a PHP-based framework designed to provide developers with a streamlined and simplified MVC environment for web development. The framework is publicly released under the MIT License, granting users the freedom to use, modify, and distribute it as they see fit.",
        "fi": "Kristal Framework on PHP-pohjainen kehys, joka on suunniteltu tarjoamaan kehittäjille virtaviivainen ja yksinkertaistettu MVC-ympäristö verkkosivustojen kehittämiseen. Kehys on julkaistu julkisesti MIT-lisenssin alaisena, mikä antaa käyttäjille vapauden käyttää, muokata ja jakaa sitä mielensä mukaan."
    },
    "home_information_2": {
        "en": "Thanks for trying out Kristal Framework, to get started please visit the <a href = 'https://www.jessetimonen.fi/kristal/documentation' target = '_blank'>documentations</a>.",
        "fi": "Kiitos Kristal Framework:in kokeilemisesta, jotta pääset alkuun käy tutustumassa <a href = 'https://www.jessetimonen.fi/kristal/documentation' target = '_blank'>dokumentaatioihin</a>."
    },




    "demo_page_title": {
        "en": "Kristal Framework Demo Page",
        "fi": "Kristal Framework Demo Sivu"
    },
    "demo_page_description": {
        "en": "This page showcases a wide array of the framework's demo features. Explore the numerous possibilities at your disposal",
        "fi": "Tämä sivu esittelee laajan valikoiman kehyksen demo-ominaisuuksia. Tutustu lukuisiin mahdollisuuksiin, joita voit hyödyntää!"
    },
    "theme_title": {
        "en": "Theme",
        "fi": "Teemaa"
    },
    "theme_description": {
        "en": "The active theme is integrated within the HTML header template found at 'App/Pages/Base/'. This header utilizes the theme stored in the active session, defaulting to the preset theme in the config.php file if none is specified. You can modify the theme using a form that initiates a request to alter it. This request is then relayed to a controller that updates the session with the new theme.",
        "fi": "Aktiivinen teema on sisällytetty HTML-otsikkopohjaan, joka sijaitsee osoitteessa 'App/Pages/Base/'. Tämä otsikko käyttää istunnossa tallennettua teemaa, ja jos teemaa ei ole määritelty, se palautuu oletusteemaan, joka on määritetty config.php-tiedostossa. Voit muuttaa teemaa lomakkeella, joka lähettää pyynnön teeman vaihtamiseksi. Tämä pyyntö välitetään sitten ohjaimelle, joka päivittää istunnon uudella teemalla."
    },
    "activate_dark_button": {
        "en": "Activate Dark Theme",
        "fi": "Aktivoi Tumma Teema"
    },
    "activate_light_button": {
        "en": "Activate Light Theme",
        "fi": "Aktivoi Vaalea Teema"
    },





    "404_page_not_found": {
        "en": "Page not found",
        "fi": "Sivua ei löytynyt"
    },
    "404_return_link": {
        "en": "Return to home page by clicking here!",
        "fi": "Palaa takaisin etusivulle painamalla tästä!"
    },





    "maintenance_title": {
        "en": "Maintenance",
        "fi": "Päivitys"
    },
    "maintenance_description": {
        "en": "We are currently maintaining our website, we will be back shortly. Thanks for your patience.",
        "fi": "Olemme päivittämässä sivujamme, olemme valmiina hetken kuluttua. Kiitos kärsivällisyydestäsi."
    },
    "maintenance_authentication": {
        "en": "Authentication",
        "fi": "Kirjautuminen"
    },
    "maintenance_password": {
        "en": "Password",
        "fi": "Salasana"
    },
    "maintenance_authentication_failed": {
        "en": "Failed to authenticate!",
        "fi": "Kirjautuminen epäonnistui!"
    },
    "maintenance_authentication_timeout_1": {
        "en": "Too many login attempts, please wait ",
        "fi": "Liian monta kirjautumisyritystä, odota "
    },
    "maintenance_authentication_timeout_2": {
        "en": " before you can try again.",
        "fi": " kunnes voit kokeilla uudelleen."
    },
    "maintenance_login": {
        "en": "Sign In",
        "fi": "Kirjaudu"
    },
    "maintenance_email": {
        "en": "Email",
        "fi": "Sähköposti"
    }
}